import React, { Fragment, FunctionComponent, useState } from 'react'

const App: FunctionComponent = () => {
  const [text, setText] = useState('')

  return (
    <Fragment>
      <input onChange={(event) => setText(event.target.value)} value={text} />
      <p>{toKatakana(text)}</p>
    </Fragment>
  )
}

const toKatakana = (string: string) => {
  return string
    .replace(/[ぁ-ゔ]/g, (s) => String.fromCharCode(s.charCodeAt(0) + 0x60))
    .replace(/ﾞ/g, '゛')
    .replace(/ﾟ/g, '゜')
    .replace(/(ウ゛)/g, 'ヴ')
    .replace(/(ワ゛)/g, 'ヷ')
    .replace(/(ヰ゛)/g, 'ヸ')
    .replace(/(ヱ゛)/g, 'ヹ')
    .replace(/(ヲ゛)/g, 'ヺ')
    .replace(/(ゝ゛)/g, 'ヾ')
    .replace(/ゝ/g, 'ヽ')
    .replace(/ゞ/g, 'ヾ')
    .replace(/ゕ/g, 'ヵ')
    .replace(/ゖ/g, 'ヶ')
    .split('')
    .map((key) => katakana.get(key) || key)
    .join('')
}

const katakana = new Map([
  ['ア', 'ｱ'],
  ['イ', 'ｲ'],
  ['ウ', 'ｳ'],
  ['エ', 'ｴ'],
  ['オ', 'ｵ'],
  ['カ', 'ｶ'],
  ['キ', 'ｷ'],
  ['ク', 'ｸ'],
  ['ケ', 'ｹ'],
  ['コ', 'ｺ'],
  ['サ', 'ｻ'],
  ['シ', 'ｼ'],
  ['ス', 'ｽ'],
  ['セ', 'ｾ'],
  ['ソ', 'ｿ'],
  ['タ', 'ﾀ'],
  ['チ', 'ﾁ'],
  ['ツ', 'ﾂ'],
  ['テ', 'ﾃ'],
  ['ト', 'ﾄ'],
  ['ナ', 'ﾅ'],
  ['ニ', 'ﾆ'],
  ['ヌ', 'ﾇ'],
  ['ネ', 'ﾈ'],
  ['ノ', 'ﾉ'],
  ['ハ', 'ﾊ'],
  ['ヒ', 'ﾋ'],
  ['フ', 'ﾌ'],
  ['ヘ', 'ﾍ'],
  ['ホ', 'ﾎ'],
  ['マ', 'ﾏ'],
  ['ミ', 'ﾐ'],
  ['ム', 'ﾑ'],
  ['メ', 'ﾒ'],
  ['モ', 'ﾓ'],
  ['ヤ', 'ﾔ'],
  ['ユ', 'ﾕ'],
  ['ヨ', 'ﾖ'],
  ['ラ', 'ﾗ'],
  ['リ', 'ﾘ'],
  ['ル', 'ﾙ'],
  ['レ', 'ﾚ'],
  ['ロ', 'ﾛ'],
  ['ワ', 'ﾜ'],
  ['ヲ', 'ｦ'],
  ['ン', 'ﾝ'],
  ['ァ', 'ｧ'],
  ['ィ', 'ｨ'],
  ['ゥ', 'ｩ'],
  ['ェ', 'ｪ'],
  ['ォ', 'ｫ'],
  ['ッ', 'ｯ'],
  ['ャ', 'ｬ'],
  ['ュ', 'ｭ'],
  ['ョ', 'ｮ'],
  ['ガ', 'ｶﾞ'],
  ['ギ', 'ｷﾞ'],
  ['グ', 'ｸﾞ'],
  ['ゲ', 'ｹﾞ'],
  ['ゴ', 'ｺﾞ'],
  ['ザ', 'ｻﾞ'],
  ['ジ', 'ｼﾞ'],
  ['ズ', 'ｽﾞ'],
  ['ゼ', 'ｾﾞ'],
  ['ゾ', 'ｿﾞ'],
  ['ダ', 'ﾀﾞ'],
  ['ヂ', 'ﾁﾞ'],
  ['ヅ', 'ﾂﾞ'],
  ['デ', 'ﾃﾞ'],
  ['ド', 'ﾄﾞ'],
  ['バ', 'ﾊﾞ'],
  ['ビ', 'ﾋﾞ'],
  ['ブ', 'ﾌﾞ'],
  ['ベ', 'ﾍﾞ'],
  ['ボ', 'ﾎﾞ'],
  ['パ', 'ﾊﾟ'],
  ['ピ', 'ﾋﾟ'],
  ['プ', 'ﾌﾟ'],
  ['ペ', 'ﾍﾟ'],
  ['ポ', 'ﾎﾟ'],
  ['ヴ', 'ｳﾞ'],
  ['ヷ', 'ﾜﾞ'],
  ['ヺ', 'ｦﾞ'],
  ['。', '｡'],
  ['、', '､'],
  ['ー', 'ｰ'],
  ['「', '｢'],
  ['」', '｣'],
  ['・', '･'],
  ['゛', 'ﾞ'],
  ['゜', 'ﾟ'],
])

export default App
